<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"8dc813f2d45c4a4aaf53aaaf39e6dc3c41bbd3d2ac6ad475bd3c997e1bcacb62","plan_job_ref":"Job plan #13 at https://github.com/GSA/usnotify-ssb/actions/runs/4823206021","plan_hash":"320bb7c9d90253a6ee76137f6bf19f48c2aee46805d4519dd1c971bb710480e5","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 4 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-sms"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "SlpDWmhT0gDD8n9zIOvo9Hz/L9uqtEUVNetAjHnZ6g0=" -> "Azau63OizjMPWBKlG+JGVKz6I48LdURxiTCOOxPZBzA="
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
        # (13 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "d9610756-6abb-4b90-984d-494853939c08" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "d9610756-6abb-4b90-984d-494853939c08"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "dd324353-af5b-4460-98b5-913fb013ff89"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management"
        # (8 unchanged attributes hidden)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "c360abb4-f3fa-434b-95c2-85d1f8bddde3"
        name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-production"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-smtp"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "ULiD8aKL0bK+/ZSMAP6hktxfsnol1ppgx7HAMDCCSZs=" -> "OfGBYaIM6hHzeGqV0dDVPgkeozKZDgjBx0hkCzOK2sc="
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
        # (13 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "9ed64b91-c24b-4e4c-9c13-1d8a906ef811" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "9ed64b91-c24b-4e4c-9c13-1d8a906ef811"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "7ab65f72-d3de-451b-be85-783ce2b55867"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management"
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "76b49f02-670d-4fda-aeb7-307bd0de42e0"
        name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-production"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #14](https://github.com/GSA/usnotify-ssb/actions/runs/4824362535)